Tekla Open API Reference for Tekla Structures 2025
Seam.GetInputPolygon Method
 Returns the input polygon of the seam.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polygon GetInputPolygon()
Public Function GetInputPolygon As Polygon
Return Value
Type: Polygon
The input polygon of the seam instance.
See Also
Reference
Seam Class
Tekla.Structures.Model Namespace